burakenez/gd32e502-demo-suites-cmake-vscode/Drivers/GD32E502_standard_peripheral/Source/gd32e502_can.c
    /* set filter identifier 0 */
    reg = 0U;
    if((uint32_t)SET == expect->ide) {
        reg |= CAN_PN_EID0_EIDE;
    }
    if((uint32_t)SET == expect->rtr) {
        reg |= CAN_PN_EID0_ERTR;
    }
    if(CAN_STANDARD == (expect->id & BIT(31))){
        reg |= (uint32_t)PN_EID0_EIDF_ELT_STD(expect->id);
    }else{
        reg |= (uint32_t)PN_EID0_EIDF_ELT_EXD(expect->id);
    }

    CAN_PN_EID0(can_periph) = reg;

    temp = CAN_PN_CTL0(can_periph);
    reg = 0U;
    /* ID field 1 is used when ID filtering type is EXACT or RANGE */
    if(((temp & CAN_PN_CTL0_IDFT) == CAN_PN_ID_FILTERING_EXACT) || ((temp & CAN_PN_CTL0_IDFT) == CAN_PN_ID_FILTERING_RANGE)) {
        if(CAN_STANDARD == (filter->id & BIT(31))){
            reg |= (uint32_t)PN_IFEID1_IDEFD_STD(filter->id);
        }else{
            reg |= (uint32_t)PN_IFEID1_IDEFD_EXD(filter->id);
        }
    }
    if((uint32_t)SET == filter->ide) {
        reg |= CAN_PN_IFEID1_IDEFD;
    }
    if((uint32_t)SET == filter->rtr) {
        reg |= CAN_PN_IFEID1_RTRFD;
    }
    /* set filter identifier 1 */
    CAN_PN_IFEID1(can_periph) = reg;

    /* data field is used when frame filtering type is not MATCH or MATCH NMM */
    if(((temp & CAN_PN_CTL0_FFT) == CAN_PN_FRAME_FILTERING_ID_DATA) ||
            ((temp & CAN_PN_CTL0_FFT) == CAN_PN_FRAME_FILTERING_ID_DATA_NMM)) {
        /* set filter data payload 0 */
        CAN_PN_EDLC(can_periph) = PN_EDLC_DLCEHT(expect->dlc_high_threshold) | PN_EDLC_DLCELT(expect->dlc_low_threshold);
        CAN_PN_EDL0(can_periph) = ((expect->payload[0] << 24U) & CAN_PN_EDL0_DB0ELT) |
                                  ((expect->payload[0] << 8U) & CAN_PN_EDL0_DB1ELT) |
                                  ((expect->payload[0] >> 8U) & CAN_PN_EDL0_DB2ELT) |
                                  ((expect->payload[0] >> 24U) & CAN_PN_EDL0_DB3ELT);
        CAN_PN_EDL1(can_periph) = ((expect->payload[1] << 24U) & CAN_PN_EDL1_DB4ELT) |
                                  ((expect->payload[1] << 8U) & CAN_PN_EDL1_DB5ELT) |
                                  ((expect->payload[1] >> 8U) & CAN_PN_EDL1_DB6ELT) |
                                  ((expect->payload[1] >> 24U) & CAN_PN_EDL1_DB7ELT);

        /* data field 1 is used when data filtering type is EXACT or RANGE */
        if(((temp & CAN_PN_CTL0_DATAFT) == CAN_PN_DATA_FILTERING_EXACT)
                || ((temp & CAN_PN_CTL0_DATAFT) == CAN_PN_DATA_FILTERING_RANGE)) {
            /* set filter data payload 1 */
            CAN_PN_DF0EDH0(can_periph) = ((filter->payload[0] << 24U) & CAN_PN_DF0EDH0_DB0FD_EHT) |
                                         ((filter->payload[0] << 8U) & CAN_PN_DF0EDH0_DB1FD_EHT) |
                                         ((filter->payload[0] >> 8U) & CAN_PN_DF0EDH0_DB2FD_EHT) |
                                         ((filter->payload[0] >> 24U) & CAN_PN_DF0EDH0_DB3FD_EHT);
            CAN_PN_DF1EDH1(can_periph) = ((filter->payload[1] << 24U) & CAN_PN_DF1EDH1_DB4FD_EHT) |
                                         ((filter->payload[1] << 8U) & CAN_PN_DF1EDH1_DB5FD_EHT) |
                                         ((filter->payload[1] >> 8U) & CAN_PN_DF1EDH1_DB6FD_EHT) |
                                         ((filter->payload[1] >> 24U) & CAN_PN_DF1EDH1_DB7FD_EHT);
        }
    }
}


/*!
    \brief      get matching message counter of Pretended Networking mode
    \param[in]  can_periph: CANx(x=0,1)
    \param[out] none
    \retval     0~255 or -1
*/
int32_t can_pn_mode_num_of_match_get(uint32_t can_periph)
{
    int32_t ret = 0;
    uint32_t reg = 0U;

    reg = CAN_PN_STAT(can_periph);
    if(0U != (reg & CAN_PN_STAT_MMCNTS)) {
        ret = (int32_t)(uint32_t)GET_PN_STAT_MMCNT(reg);
    } else {
        ret = -1;
    }
    return ret;
}

/*!
    \brief      get matching message
    \param[in]  can_periph: CANx(x=0,1)
    \param[in]  index: Pretended Networking mailbox index
                only one parameter can be selected which is shown as below:
      \arg        0 - 31
    \param[out] mdpara: wakeup message information
    \retval     none
*/
void can_pn_mode_data_read(uint32_t can_periph, uint32_t index, can_mailbox_descriptor_struct *mdpara)
{
    uint32_t *mdaddr = (uint32_t *)mdpara;
    uint32_t *pnram = (uint32_t *)(uint32_t)(CAN_PN_RAM(can_periph) + index * 16U);

    mdaddr[0] = pnram[0];
    mdaddr[1] = pnram[1];
    /* get mailbox ID */
    if(0U != mdpara->ide) {
        mdpara->id = GET_MDES1_ID_EXD(mdpara->id);
    } else {
        mdpara->id = GET_MDES1_ID_STD(mdpara->id);
    }

    /* remote frame */
    if(0U != (mdaddr[0] & CAN_PN_RWMXCS_RRTR)){
        mdpara->data_bytes = 0U;
    }else{
        /* classical frame */
        if(mdpara->dlc <= 8U) {
            mdpara->data_bytes = mdpara->dlc;
        }else{
            mdpara->data_bytes = 8U;
        }
    }

    if(mdpara->data_bytes) {
        can_data_to_little_endian_swap(mdpara->data, &pnram[2], mdpara->data_bytes);
    }
}

/*!
    \brief      enable self reception
    \param[in]  can_periph: CANx(x=0,1)
    \param[out] none
    \retval     none
*/
void can_self_reception_enable(uint32_t can_periph)
{
    CAN_CTL0(can_periph) &= ~CAN_CTL0_SRDIS;
}

/*!
    \brief      disable self reception
    \param[in]  can_periph: CANx(x=0,1)
    \param[out] none
    \retval     none
*/
void can_self_reception_disable(uint32_t can_periph)
{
    CAN_CTL0(can_periph) |= CAN_CTL0_SRDIS;
}

/*!
    \brief      enable transmit abort
    \param[in]  can_periph: CANx(x=0,1)
    \param[out] none
    \retval     none
*/
void can_transmit_abort_enable(uint32_t can_periph)
{
    CAN_CTL0(can_periph) |= CAN_CTL0_MST;
}

/*!
    \brief      disable transmit abort
    \param[in]  can_periph: CANx(x=0,1)
    \param[out] none
    \retval     none
*/
void can_transmit_abort_disable(uint32_t can_periph)
{
    CAN_CTL0(can_periph) &= ~CAN_CTL0_MST;
}

/*!
    \brief      enable auto bus off recovery mode
    \param[in]  can_periph: CANx(x=0,1)
    \param[out] none
    \retval     none
*/
void can_auto_busoff_recovery_enable(uint32_t can_periph)
{
    CAN_CTL1(can_periph) &= ~CAN_CTL1_ABORDIS;
}

/*!
    \brief      disable auto bus off recovery mode
    \param[in]  can_periph: CANx(x=0,1)
    \param[out] none
    \retval     none
*/
void can_auto_busoff_recovery_disable(uint32_t can_periph)
{
    CAN_CTL1(can_periph) |= CAN_CTL1_ABORDIS;
}

/*!
    \brief      enable time sync mode
    \param[in]  can_periph: CANx(x=0,1)
    \param[out] none
    \retval     none
*/
void can_time_sync_enable(uint32_t can_periph)
{
    CAN_CTL1(can_periph) |= CAN_CTL1_TSYNC;
}

/*!
    \brief      disable time sync mode
    \param[in]  can_periph: CANx(x=0,1)
    \param[out] none
    \retval     none
*/
void can_time_sync_disable(uint32_t can_periph)
{
    CAN_CTL1(can_periph) &= ~CAN_CTL1_TSYNC;
}

/*!
    \brief      enable edge filter mode
    \param[in]  can_periph: CANx(x=0,1)
    \param[out] none
    \retval     none
*/
void can_edge_filter_mode_enable(uint32_t can_periph)
{
    CAN_CTL2(can_periph) &= ~CAN_CTL2_EFDIS;
}

/*!
    \brief      disable edge filter mode
    \param[in]  can_periph: CANx(x=0,1)
    \param[out] none
    \retval     none
*/
void can_edge_filter_mode_disable(uint32_t can_periph)
{
    CAN_CTL2(can_periph) |= CAN_CTL2_EFDIS;
}

/*!
    \brief      enable protocol exception detection mode
    \param[in]  can_periph: CANx(x=0,1)
    \param[out] none
    \retval     none
*/
void can_ped_mode_enable(uint32_t can_periph)
{
    CAN_CTL2(can_periph) |= CAN_CTL2_PREEN;
}

/*!
    \brief      disable protocol exception detection mode
    \param[in]  can_periph: CANx(x=0,1)
    \param[out] none
    \retval     none
*/
void can_ped_mode_disable(uint32_t can_periph)
{
    CAN_CTL2(can_periph) &= ~CAN_CTL2_PREEN;
}

/*!
    \brief      configure arbitation delay bits
    \param[in]  can_periph: CANx(x=0,1)
    \param[in]  delay_bits: delay bits
                only one parameter can be selected which is shown as below:
      \arg        0 - 31
    \param[out] none
    \retval     none
*/
void can_arbitation_delay_bits_config(uint32_t can_periph, uint32_t delay_bits)
{
    CAN_CTL2(can_periph) &= ~CAN_CTL2_ASD;
    CAN_CTL2(can_periph) |= (uint32_t)CTL2_ASD(delay_bits);
}

/*!
    \brief      configure bit sampling mode
    \param[in]  can_periph: CANx(x=0,1)
    \param[in]  sampling_mode: bit sampling mode
                only one parameter can be selected which is shown as below:
      \arg        CAN_BSP_MODE_ONE_SAMPLE: one sample for received bit
      \arg        CAN_BSP_MODE_THREE_SAMPLES: three samples for received bit
    \param[out] none
    \retval     none
*/
void can_bsp_mode_config(uint32_t can_periph, uint32_t sampling_mode)
{
    if(CAN_BSP_MODE_ONE_SAMPLE == sampling_mode) {
        CAN_CTL1(can_periph) &= ~CAN_CTL1_BSPMOD;
    } else {
        CAN_CTL1(can_periph) |= CAN_CTL1_BSPMOD;
    }
}

/*!
    \brief      get CAN flag
    \param[in]  can_periph: CANx(x=0,1)
    \param[in]  flag: CAN flags, refer to can_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        CAN_FLAG_CAN_PN: Pretended Networking state flag
      \arg        CAN_FLAG_SOFT_RST: software reset flag
      \arg        CAN_FLAG_ERR_SUMMARY: error summary flag
      \arg        CAN_FLAG_BUSOFF: bus off flag
      \arg        CAN_FLAG_RECEIVING: receiving state flag
      \arg        CAN_FLAG_TRANSMITTING: transmitting state flag
      \arg        CAN_FLAG_IDLE: IDLE state flag
      \arg        CAN_FLAG_RX_WARNING: receive warning flag
      \arg        CAN_FLAG_TX_WARNING: transmit warning flag
      \arg        CAN_FLAG_STUFF_ERR: stuff error flag
      \arg        CAN_FLAG_FORM_ERR: form error flag
      \arg        CAN_FLAG_CRC_ERR: CRC error flag
      \arg        CAN_FLAG_ACK_ERR: ACK error flag
      \arg        CAN_FLAG_BIT_DOMINANT_ERR: bit dominant error flag
      \arg        CAN_FLAG_BIT_RECESSIVE_ERR: bit recessive error flag
      \arg        CAN_FLAG_SYNC_ERR: synchronization flag
      \arg        CAN_FLAG_BUSOFF_RECOVERY: bus off recovery flag
      \arg        CAN_FLAG_ERR_SUMMARY_FD: fd error summary flag
      \arg        CAN_FLAG_ERR_OVERRUN: error overrun flag
      \arg        CAN_FLAG_STUFF_ERR_FD: stuff error in FD data phase flag
      \arg        CAN_FLAG_FORM_ERR_FD: form error in FD data phase flag
      \arg        CAN_FLAG_CRC_ERR_FD: CRC error in FD data phase flag
      \arg        CAN_FLAG_BIT_DOMINANT_ERR_FD: bit dominant error in FD data phase flag
      \arg        CAN_FLAG_BIT_RECESSIVE_ERR_FD: bit recessive error in FD data phase flag
      \arg        CAN_FLAG_MBx(x=0~31): mailbox x flag
      \arg        CAN_FLAG_FIFO_AVAILABLE: fifo available flag
      \arg        CAN_FLAG_FIFO_WARNING: fifo warning flag
      \arg        CAN_FLAG_FIFO_OVERFLOW: fifo overflow flag
      \arg        CAN_FLAG_WAKEUP_MATCH: Pretended Networking match flag
      \arg        CAN_FLAG_WAKEUP_TIMEOUT: Pretended Networking timeout wakeup flag
      \arg        CAN_FLAG_TDC_OUT_OF_RANGE: transmitter delay is out of compensation range flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus can_flag_get(uint32_t can_periph, can_flag_enum flag)
{
    if(CAN_REG_VAL(can_periph, flag) & BIT(CAN_BIT_POS(flag))) {
        return SET;
    } else {
        return RESET;
    }
}

/*!
    \brief      clear CAN flag
    \param[in]  can_periph: CANx(x=0,1)
    \param[in]  flag: CAN flags, refer to can_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        CAN_FLAG_ERR_SUMMARY: error summary flag
      \arg        CAN_FLAG_BUSOFF: bus off flag
      \arg        CAN_FLAG_BUSOFF_RECOVERY: bus off recovery flag
      \arg        CAN_FLAG_ERR_SUMMARY_FD: fd error summary flag
      \arg        CAN_FLAG_ERR_OVERRUN: error overrun flag
      \arg        CAN_FLAG_MBx(x=0~31): mailbox x flag
      \arg        CAN_FLAG_FIFO_AVAILABLE: fifo available flag
      \arg        CAN_FLAG_FIFO_WARNING: fifo warning flag
      \arg        CAN_FLAG_FIFO_OVERFLOW: fifo overflow flag
      \arg        CAN_FLAG_WAKEUP_MATCH: Pretended Networking match flag
      \arg        CAN_FLAG_WAKEUP_TIMEOUT: Pretended Networking timeout wakeup flag
      \arg        CAN_FLAG_TDC_OUT_OF_RANGE: transmitter delay is out of compensation range flag
    \param[out] none
    \retval     none
*/
void can_flag_clear(uint32_t can_periph, can_flag_enum flag)
{
    if(CAN_FLAG_TDC_OUT_OF_RANGE == flag) {
        CAN_FDCTL(can_periph) |= CAN_FDCTL_TDCS;
    } else {
        CAN_REG_VAL(can_periph, flag) = BIT(CAN_BIT_POS(flag));
    }
}

/*!
    \brief      enable CAN interrupt
    \param[in]  can_periph: CANx(x=0,1)
    \param[in]  interrupt: CAN interrupt, refer to can_interrupt_enum
                only one parameter can be selected which is shown as below:
      \arg        CAN_INT_ERR_SUMMARY: error interrupt
      \arg        CAN_INT_RX_WARNING: receive warning interrupt
      \arg        CAN_INT_TX_WARNING: transmit warning interrupt
      \arg        CAN_INT_BUSOFF: bus off interrupt
      \arg        CAN_INT_BUSOFF_RECOVERY: bus off recovery interrupt
      \arg        CAN_INT_ERR_SUMMARY_FD: fd error interrupt
      \arg        CAN_INT_MBx(x=0~31): mailbox x interrupt
      \arg        CAN_INT_FIFO_AVAILABLE: fifo availabe interrupt
      \arg        CAN_INT_FIFO_WARNING: fifo warning interrupt
      \arg        CAN_INT_FIFO_OVERFLOW: fifo overflow interrupt
      \arg        CAN_INT_WAKEUP_MATCH: Pretended Networking match interrupt
      \arg        CAN_INT_WAKEUP_TIMEOUT: Pretended Networking timeout wakeup interrupt
    \param[out] none
    \retval     ERROR or SUCCESS
*/
ErrStatus can_interrupt_enable(uint32_t can_periph, can_interrupt_enum interrupt)
{
    can_operation_modes_enum mode = CAN_NORMAL_MODE;
    ErrStatus ret = SUCCESS;

    /* enable receive or transmit warning error interrupt should enable error warning in CTL0 register  */
    if((CAN_INT_RX_WARNING == interrupt) || (CAN_INT_TX_WARNING == interrupt)) {
        mode = can_operation_mode_get(can_periph);
        /* in INACTIVE mode */
        if(CAN_INACTIVE_MODE == mode){
            CAN_CTL0(can_periph) |= CAN_CTL0_WERREN;
        }else{
            ret = can_operation_mode_enter(can_periph, CAN_INACTIVE_MODE);
            if(SUCCESS == ret){
                CAN_CTL0(can_periph) |= CAN_CTL0_WERREN;
                ret = can_operation_mode_enter(can_periph, mode);
            }
        }
    }

    CAN_REG_VAL(can_periph, interrupt) |= BIT(CAN_BIT_POS(interrupt));
    return ret;
}

/*!
    \brief      disable CAN interrupt
    \param[in]  can_periph: CANx(x=0,1)
    \param[in]  interrupt: CAN interrupt, refer to can_interrupt_enum
                only one parameter can be selected which is shown as below:
      \arg        CAN_INT_ERR_SUMMARY: error interrupt
      \arg        CAN_INT_RX_WARNING: receive warning interrupt
      \arg        CAN_INT_TX_WARNING: transmit warning interrupt
      \arg        CAN_INT_BUSOFF: bus off interrupt
      \arg        CAN_INT_BUSOFF_RECOVERY: bus off recovery interrupt
      \arg        CAN_INT_ERR_SUMMARY_FD: fd error interrupt
      \arg        CAN_INT_MBx(x=0~31): mailbox x interrupt
      \arg        CAN_INT_FIFO_AVAILABLE: fifo available interrupt
      \arg        CAN_INT_FIFO_WARNING: fifo warning interrupt
      \arg        CAN_INT_FIFO_OVERFLOW: fifo overflow interrupt
      \arg        CAN_INT_WAKEUP_MATCH: Pretended Networking match interrupt
      \arg        CAN_INT_WAKEUP_TIMEOUT: Pretended Networking timeout wakeup interrupt
    \param[out] none
    \retval     ERROR or SUCCESS
*/
ErrStatus can_interrupt_disable(uint32_t can_periph, can_interrupt_enum interrupt)
{
    can_operation_modes_enum mode = CAN_NORMAL_MODE;
    ErrStatus ret = SUCCESS;

    /* disable receive or transmit warning error interrupt should enable error warning in CTL0 register  */
    if((0U == (CAN_CTL0(can_periph) & CAN_CTL0_WERREN)) && ((CAN_INT_RX_WARNING == interrupt) || (CAN_INT_TX_WARNING == interrupt))) {
        mode = can_operation_mode_get(can_periph);
        /* in INACTIVE mode */
        if(CAN_INACTIVE_MODE == mode){
            CAN_CTL0(can_periph) |= CAN_CTL0_WERREN;
        }else{
            ret = can_operation_mode_enter(can_periph, CAN_INACTIVE_MODE);
            if(SUCCESS == ret){
                CAN_CTL0(can_periph) |= CAN_CTL0_WERREN;
                ret = can_operation_mode_enter(can_periph, mode);
            }
        }
    }

    CAN_REG_VAL(can_periph, interrupt) &= ~BIT(CAN_BIT_POS(interrupt));
    return ret;
}

/*!
    \brief      get CAN interrupt flag
    \param[in]  can_periph: CANx(x=0,1)
    \param[in]  int_flag: CAN interrupt flags, refer to can_interrupt_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        CAN_INT_FLAG_ERR_SUMMARY: error summary interrupt flag
      \arg        CAN_INT_FLAG_BUSOFF: bus off interrupt flag
      \arg        CAN_INT_FLAG_RX_WARNING: receive warning interrupt flag
      \arg        CAN_INT_FLAG_TX_WARNING: transmit warning interrupt flag
      \arg        CAN_INT_FLAG_BUSOFF_RECOVERY: bus off recovery interrupt flag
      \arg        CAN_INT_FLAG_ERR_SUMMARY_FD: fd error summary interrupt flag
      \arg        CAN_INT_FLAG_MBx(x=0~31): mailbox x interrupt flag
      \arg        CAN_INT_FLAG_FIFO_AVAILABLE: fifo available interrupt flag
      \arg        CAN_INT_FLAG_FIFO_WARNING: fifo warning interrupt flag
      \arg        CAN_INT_FLAG_FIFO_OVERFLOW: fifo overflow interrupt flag
      \arg        CAN_INT_FLAG_WAKEUP_MATCH: Pretended Networking match interrupt flag
      \arg        CAN_INT_FLAG_WAKEUP_TIMEOUT: Pretended Networking timeout wakeup interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus can_interrupt_flag_get(uint32_t can_periph, can_interrupt_flag_enum int_flag)
{
    if(CAN_REG_VAL(can_periph, int_flag) & BIT(CAN_BIT_POS(int_flag))) {
        return SET;
    } else {
        return RESET;
    }
}

/*!
    \brief      clear CAN interrupt flag
    \param[in]  can_periph: CANx(x=0,1)
    \param[in]  int_flag: CAN interrupt flags, refer to can_interrupt_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        CAN_INT_FLAG_ERR_SUMMARY: error summary interrupt flag
      \arg        CAN_INT_FLAG_BUSOFF: bus off interrupt flag
      \arg        CAN_INT_FLAG_RX_WARNING: receive warning interrupt flag
      \arg        CAN_INT_FLAG_TX_WARNING: transmit warning interrupt flag
      \arg        CAN_INT_FLAG_BUSOFF_RECOVERY: bus off recovery interrupt flag
      \arg        CAN_INT_FLAG_ERR_SUMMARY_FD: fd error summary interrupt flag
      \arg        CAN_INT_FLAG_MBx(x=0~31): mailbox x interrupt flag
      \arg        CAN_INT_FLAG_FIFO_AVAILABLE: fifo availabe interrupt flag
      \arg        CAN_INT_FLAG_FIFO_WARNING: fifo warning interrupt flag
      \arg        CAN_INT_FLAG_FIFO_OVERFLOW: fifo overflow interrupt flag
      \arg        CAN_INT_FLAG_WAKEUP_MATCH: Pretended Networking match interrupt flag
      \arg        CAN_INT_FLAG_WAKEUP_TIMEOUT: Pretended Networking timeout wakeup interrupt flag
    \param[out] none
    \retval     none
*/
void can_interrupt_flag_clear(uint32_t can_periph, can_interrupt_flag_enum int_flag)
{
    CAN_REG_VAL(can_periph, int_flag) = BIT(CAN_BIT_POS(int_flag));
}

/*!
    \brief      computes the maximum payload size (in bytes), given a dlc
    \param[in]  mdes0: mailbox descriptor 0 data
    \param[out] none
    \retval     payload_size
*/
static uint32_t can_payload_size_compute(uint32_t mdes0)
{
    uint8_t ret = 0U;
    uint32_t dlc_value = GET_MDES0_DLC(mdes0);

